; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph3 - mode
	thermograph0 - mode
	thermograph2 - mode
	infrared1 - mode
	Star2 - direction
	GroundStation3 - direction
	Star1 - direction
	Star0 - direction
	Star4 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 139)
	(= (data Star5 thermograph3) 215)
	(= (data Planet6 thermograph3) 82)
	(= (data Phenomenon7 thermograph3) 217)
	(= (data Star8 thermograph3) 70)
	(= (data Planet9 thermograph3) 162)
	(= (data Phenomenon10 thermograph3) 160)
	(= (data Star11 thermograph3) 71)
	(= (data Star5 thermograph0) 245)
	(= (data Planet6 thermograph0) 60)
	(= (data Phenomenon7 thermograph0) 119)
	(= (data Star8 thermograph0) 215)
	(= (data Planet9 thermograph0) 102)
	(= (data Phenomenon10 thermograph0) 58)
	(= (data Star11 thermograph0) 228)
	(= (data Star5 thermograph2) 235)
	(= (data Planet6 thermograph2) 146)
	(= (data Phenomenon7 thermograph2) 37)
	(= (data Star8 thermograph2) 21)
	(= (data Planet9 thermograph2) 49)
	(= (data Phenomenon10 thermograph2) 143)
	(= (data Star11 thermograph2) 129)
	(= (data Star5 infrared1) 46)
	(= (data Planet6 infrared1) 26)
	(= (data Phenomenon7 infrared1) 37)
	(= (data Star8 infrared1) 13)
	(= (data Planet9 infrared1) 300)
	(= (data Phenomenon10 infrared1) 168)
	(= (data Star11 infrared1) 161)
	(= (slew_time Star2 Star0) 73.81)
	(= (slew_time Star0 Star2) 73.81)
	(= (slew_time Star2 Star1) 22.99)
	(= (slew_time Star1 Star2) 22.99)
	(= (slew_time GroundStation3 Star0) 7.319)
	(= (slew_time Star0 GroundStation3) 7.319)
	(= (slew_time GroundStation3 Star1) 18.02)
	(= (slew_time Star1 GroundStation3) 18.02)
	(= (slew_time GroundStation3 Star2) 62.28)
	(= (slew_time Star2 GroundStation3) 62.28)
	(= (slew_time Star1 Star0) 15.02)
	(= (slew_time Star0 Star1) 15.02)
	(= (slew_time Star4 Star0) 32.71)
	(= (slew_time Star0 Star4) 32.71)
	(= (slew_time Star4 Star1) 57.4)
	(= (slew_time Star1 Star4) 57.4)
	(= (slew_time Star4 Star2) 73.2)
	(= (slew_time Star2 Star4) 73.2)
	(= (slew_time Star4 GroundStation3) 27.51)
	(= (slew_time GroundStation3 Star4) 27.51)
	(= (slew_time Star5 Star0) 58.65)
	(= (slew_time Star0 Star5) 58.65)
	(= (slew_time Star5 Star1) 6.087)
	(= (slew_time Star1 Star5) 6.087)
	(= (slew_time Star5 Star2) 46.52)
	(= (slew_time Star2 Star5) 46.52)
	(= (slew_time Star5 GroundStation3) 90.3)
	(= (slew_time GroundStation3 Star5) 90.3)
	(= (slew_time Star5 Star4) 49.77)
	(= (slew_time Star4 Star5) 49.77)
	(= (slew_time Planet6 Star0) 15.96)
	(= (slew_time Star0 Planet6) 15.96)
	(= (slew_time Planet6 Star1) 55.58)
	(= (slew_time Star1 Planet6) 55.58)
	(= (slew_time Planet6 Star2) 63.6)
	(= (slew_time Star2 Planet6) 63.6)
	(= (slew_time Planet6 GroundStation3) 65.65)
	(= (slew_time GroundStation3 Planet6) 65.65)
	(= (slew_time Planet6 Star4) 61.28)
	(= (slew_time Star4 Planet6) 61.28)
	(= (slew_time Planet6 Star5) 19.59)
	(= (slew_time Star5 Planet6) 19.59)
	(= (slew_time Phenomenon7 Star0) 1.272)
	(= (slew_time Star0 Phenomenon7) 1.272)
	(= (slew_time Phenomenon7 Star1) 27.47)
	(= (slew_time Star1 Phenomenon7) 27.47)
	(= (slew_time Phenomenon7 Star2) 45.61)
	(= (slew_time Star2 Phenomenon7) 45.61)
	(= (slew_time Phenomenon7 GroundStation3) 7.081)
	(= (slew_time GroundStation3 Phenomenon7) 7.081)
	(= (slew_time Phenomenon7 Star4) 5.946)
	(= (slew_time Star4 Phenomenon7) 5.946)
	(= (slew_time Phenomenon7 Star5) 4.765)
	(= (slew_time Star5 Phenomenon7) 4.765)
	(= (slew_time Phenomenon7 Planet6) 83.02)
	(= (slew_time Planet6 Phenomenon7) 83.02)
	(= (slew_time Star8 Star0) 64.05)
	(= (slew_time Star0 Star8) 64.05)
	(= (slew_time Star8 Star1) 46.82)
	(= (slew_time Star1 Star8) 46.82)
	(= (slew_time Star8 Star2) 62.57)
	(= (slew_time Star2 Star8) 62.57)
	(= (slew_time Star8 GroundStation3) 31.1)
	(= (slew_time GroundStation3 Star8) 31.1)
	(= (slew_time Star8 Star4) 21.22)
	(= (slew_time Star4 Star8) 21.22)
	(= (slew_time Star8 Star5) 45.29)
	(= (slew_time Star5 Star8) 45.29)
	(= (slew_time Star8 Planet6) 6.792)
	(= (slew_time Planet6 Star8) 6.792)
	(= (slew_time Star8 Phenomenon7) 63.36)
	(= (slew_time Phenomenon7 Star8) 63.36)
	(= (slew_time Planet9 Star0) 16.64)
	(= (slew_time Star0 Planet9) 16.64)
	(= (slew_time Planet9 Star1) 0.7772)
	(= (slew_time Star1 Planet9) 0.7772)
	(= (slew_time Planet9 Star2) 55.47)
	(= (slew_time Star2 Planet9) 55.47)
	(= (slew_time Planet9 GroundStation3) 48.26)
	(= (slew_time GroundStation3 Planet9) 48.26)
	(= (slew_time Planet9 Star4) 43.87)
	(= (slew_time Star4 Planet9) 43.87)
	(= (slew_time Planet9 Star5) 20.59)
	(= (slew_time Star5 Planet9) 20.59)
	(= (slew_time Planet9 Planet6) 43.48)
	(= (slew_time Planet6 Planet9) 43.48)
	(= (slew_time Planet9 Phenomenon7) 9.794)
	(= (slew_time Phenomenon7 Planet9) 9.794)
	(= (slew_time Planet9 Star8) 40.33)
	(= (slew_time Star8 Planet9) 40.33)
	(= (slew_time Phenomenon10 Star0) 81.88)
	(= (slew_time Star0 Phenomenon10) 81.88)
	(= (slew_time Phenomenon10 Star1) 45.25)
	(= (slew_time Star1 Phenomenon10) 45.25)
	(= (slew_time Phenomenon10 Star2) 69.74)
	(= (slew_time Star2 Phenomenon10) 69.74)
	(= (slew_time Phenomenon10 GroundStation3) 53.54)
	(= (slew_time GroundStation3 Phenomenon10) 53.54)
	(= (slew_time Phenomenon10 Star4) 5.888)
	(= (slew_time Star4 Phenomenon10) 5.888)
	(= (slew_time Phenomenon10 Star5) 31.08)
	(= (slew_time Star5 Phenomenon10) 31.08)
	(= (slew_time Phenomenon10 Planet6) 0.432)
	(= (slew_time Planet6 Phenomenon10) 0.432)
	(= (slew_time Phenomenon10 Phenomenon7) 43.8)
	(= (slew_time Phenomenon7 Phenomenon10) 43.8)
	(= (slew_time Phenomenon10 Star8) 19.24)
	(= (slew_time Star8 Phenomenon10) 19.24)
	(= (slew_time Phenomenon10 Planet9) 10.51)
	(= (slew_time Planet9 Phenomenon10) 10.51)
	(= (slew_time Star11 Star0) 7.931)
	(= (slew_time Star0 Star11) 7.931)
	(= (slew_time Star11 Star1) 54.78)
	(= (slew_time Star1 Star11) 54.78)
	(= (slew_time Star11 Star2) 13.43)
	(= (slew_time Star2 Star11) 13.43)
	(= (slew_time Star11 GroundStation3) 11.93)
	(= (slew_time GroundStation3 Star11) 11.93)
	(= (slew_time Star11 Star4) 47.62)
	(= (slew_time Star4 Star11) 47.62)
	(= (slew_time Star11 Star5) 53.69)
	(= (slew_time Star5 Star11) 53.69)
	(= (slew_time Star11 Planet6) 50.63)
	(= (slew_time Planet6 Star11) 50.63)
	(= (slew_time Star11 Phenomenon7) 15.9)
	(= (slew_time Phenomenon7 Star11) 15.9)
	(= (slew_time Star11 Star8) 71.99)
	(= (slew_time Star8 Star11) 71.99)
	(= (slew_time Star11 Planet9) 72.08)
	(= (slew_time Planet9 Star11) 72.08)
	(= (slew_time Star11 Phenomenon10) 15.19)
	(= (slew_time Phenomenon10 Star11) 15.19)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Star5 infrared1)
	(have_image Planet6 infrared1)
	(have_image Phenomenon7 thermograph2)
	(have_image Star8 thermograph0)
	(have_image Planet9 infrared1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star8 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 139 to 117.78, (fuel-used) from 0 to 21.22
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (turn_to satellite0 planet6 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 117.78 to 110.988, (fuel-used) from 21.22 to 28.012
   goals met: 0 of 5
4. (turn_to satellite0 phenomenon10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 110.988 to 110.556, (fuel-used) from 28.012 to 28.444
   goals met: 0 of 5
5. (turn_to satellite0 planet6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 110.556 to 110.124, (fuel-used) from 28.444 to 28.876
   goals met: 0 of 5
6. (turn_to satellite0 phenomenon10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 110.124 to 109.692, (fuel-used) from 28.876 to 29.308
   goals met: 0 of 5
7. (turn_to satellite0 planet6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 109.692 to 109.26, (fuel-used) from 29.308 to 29.74
   goals met: 0 of 5
8. (turn_to satellite0 phenomenon10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 109.26 to 108.828, (fuel-used) from 29.74 to 30.172
   goals met: 0 of 5
9. (turn_to satellite0 planet6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 108.828 to 108.396, (fuel-used) from 30.172 to 30.604
   goals met: 0 of 5
10. (turn_to satellite0 phenomenon10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 108.396 to 107.964, (fuel-used) from 30.604 to 31.036
   goals met: 0 of 5
11. (turn_to satellite0 planet6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 107.964 to 107.532, (fuel-used) from 31.036 to 31.468
   goals met: 0 of 5
12. (turn_to satellite0 phenomenon10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 107.532 to 107.1, (fuel-used) from 31.468 to 31.9
   goals met: 0 of 5
13. (turn_to satellite0 planet6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 107.1 to 106.668, (fuel-used) from 31.9 to 32.332
   goals met: 0 of 5
14. (turn_to satellite0 phenomenon10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 106.668 to 106.236, (fuel-used) from 32.332 to 32.764
   goals met: 0 of 5
15. (turn_to satellite0 planet6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 106.236 to 105.804, (fuel-used) from 32.764 to 33.196
   goals met: 0 of 5
16. (turn_to satellite0 phenomenon10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 105.804 to 105.372, (fuel-used) from 33.196 to 33.628
   goals met: 0 of 5
17. (turn_to satellite0 planet6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 105.372 to 104.94, (fuel-used) from 33.628 to 34.06
   goals met: 0 of 5
18. (turn_to satellite0 phenomenon10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 104.94 to 104.508, (fuel-used) from 34.06 to 34.492
   goals met: 0 of 5
19. (turn_to satellite0 planet6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 104.508 to 104.076, (fuel-used) from 34.492 to 34.924
   goals met: 0 of 5
20. (turn_to satellite0 star8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 104.076 to 97.284, (fuel-used) from 34.924 to 41.716
   goals met: 0 of 5
21. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 0 of 5
22. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 5
23. (turn_to satellite0 planet6 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 97.284 to 90.492, (fuel-used) from 41.716 to 48.508
   goals met: 0 of 5
24. (turn_to satellite0 star5 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 90.492 to 70.902, (fuel-used) from 48.508 to 68.098
   goals met: 0 of 5
25. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 0 of 5
26. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
27. (turn_to satellite0 star1 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 70.902 to 64.815, (fuel-used) from 68.098 to 74.185
   goals met: 0 of 5
28. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 5
29. (turn_to satellite0 star5 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 64.815 to 58.728, (fuel-used) from 74.185 to 80.272
   goals met: 0 of 5
30. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 58.728 to 53.963, (fuel-used) from 80.272 to 85.037
   goals met: 0 of 5
31. (take_image satellite0 phenomenon7 instrument0 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   changed: (data_capacity satellite0) from 1000 to 963, (data-stored) from 0 to 37
   goals met: 1 of 5
32. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 1 of 5
33. (turn_to satellite0 star0 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 53.963 to 52.691, (fuel-used) from 85.037 to 86.309
   goals met: 1 of 5
34. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 5
35. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 1 of 5
36. (turn_to satellite0 phenomenon7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 52.691 to 51.419, (fuel-used) from 86.309 to 87.581
   goals met: 1 of 5
37. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 51.419 to 46.654, (fuel-used) from 87.581 to 92.346
   goals met: 1 of 5
38. (take_image satellite0 star5 instrument1 infrared1)
   added: (have_image star5 infrared1)
   changed: (data_capacity satellite0) from 963 to 917, (data-stored) from 37 to 83
   goals met: 2 of 5
39. (turn_to satellite0 star1 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 46.654 to 40.567, (fuel-used) from 92.346 to 98.433
   goals met: 2 of 5
40. (turn_to satellite0 planet9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet9)
   changed: (fuel satellite0) from 40.567 to 39.7898, (fuel-used) from 98.433 to 99.2102
   goals met: 2 of 5
41. (take_image satellite0 planet9 instrument1 infrared1)
   added: (have_image planet9 infrared1)
   changed: (data_capacity satellite0) from 917 to 617, (data-stored) from 83 to 383
   goals met: 3 of 5
42. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 3 of 5
43. (switch_on instrument0 satellite0)
   deleted: (calibrated instrument0) (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 5
44. (turn_to satellite0 star1 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 39.7898 to 39.0126, (fuel-used) from 99.2102 to 99.9874
   goals met: 3 of 5
45. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 3 of 5
46. (turn_to satellite0 planet9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet9)
   changed: (fuel satellite0) from 39.0126 to 38.2354, (fuel-used) from 99.9874 to 100.765
   goals met: 3 of 5
47. (turn_to satellite0 phenomenon10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 38.2354 to 27.7254, (fuel-used) from 100.765 to 111.275
   goals met: 3 of 5
48. (turn_to satellite0 planet6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 27.7254 to 27.2934, (fuel-used) from 111.275 to 111.707
   goals met: 3 of 5
49. (turn_to satellite0 star8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 27.2934 to 20.5014, (fuel-used) from 111.707 to 118.499
   goals met: 3 of 5
50. (take_image satellite0 star8 instrument0 thermograph0)
   added: (have_image star8 thermograph0)
   changed: (data_capacity satellite0) from 617 to 402, (data-stored) from 383 to 598
   goals met: 4 of 5
51. (turn_to satellite0 planet6 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 20.5014 to 13.7094, (fuel-used) from 118.499 to 125.291
   goals met: 4 of 5
52. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 5
53. (switch_on instrument1 satellite0)
   deleted: (calibrated instrument1) (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 5
54. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 5
55. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 5
56. (turn_to satellite0 phenomenon10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 13.7094 to 13.2774, (fuel-used) from 125.291 to 125.723
   goals met: 4 of 5
57. (turn_to satellite0 star4 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 13.2774 to 7.3894, (fuel-used) from 125.723 to 131.611
   goals met: 4 of 5
58. (calibrate satellite0 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 4 of 5
59. (turn_to satellite0 phenomenon10 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon10)
   changed: (fuel satellite0) from 7.3894 to 1.5014, (fuel-used) from 131.611 to 137.499
   goals met: 4 of 5
60. (turn_to satellite0 planet6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 1.5014 to 1.0694, (fuel-used) from 137.499 to 137.931
   goals met: 4 of 5
61. (take_image satellite0 planet6 instrument2 infrared1)
   added: (have_image planet6 infrared1)
   changed: (data_capacity satellite0) from 402 to 376, (data-stored) from 598 to 624
   goals met: 5 of 5
